[
  {
    "title": "رئیس‌جمهور در جلسه هیئت دولت: اقتصاد مقاومتی اولویت اصلی است",
    "content": "رئیس‌جمهور در جلسه امروز هیئت دولت بر اولویت‌بندی اقتصاد مقاومتی تأکید کرد و گفت: باید تمام تلاش‌ها برای تقویت تولید داخلی و کاهش وابستگی به واردات متمرکز شود. وی همچنین از برنامه‌های جدید برای حمایت از تولیدکنندگان داخلی خبر داد و اظهار داشت که دولت مصمم است تا پایان سال جاری شاهد رشد قابل توجهی در بخش تولید باشیم.",
    "summary": "رئیس‌جمهور در جلسه هیئت دولت بر اولویت اقتصاد مقاومتی تأکید کرد و از برنامه‌های جدید حمایت از تولیدکنندگان خبر داد.",
    "sourceUrl": "https://www.irna.ir/news/123456",
    "imageUrl": "https://www.irna.ir/static/img/news/123456.jpg",
    "publishedAt": "2024-01-15T10:30:00Z",
    "agencyId": 1,
    "categoryIds": [1, 2],
    "tagIds": [1, 3, 11]
  },
  {
    "title": "پرسپولیس با پیروزی مقابل استقلال به صدر جدول رسید",
    "content": "تیم فوتبال پرسپولیس در دیدار حساس هفته بیست و دوم لیگ برتر، با نتیجه ۲ بر ۱ مقابل استقلال به پیروزی رسید و به صدر جدول رقابت‌ها صعود کرد. گل‌های پرسپولیس را علی علیپور و مهدی ترابی در دقیقه‌های ۳۵ و ۶۷ به ثمر رساندند. این پیروزی باعث شد تا پرسپولیس با ۴۸ امتیاز در صدر جدول قرار گیرد.",
    "summary": "پرسپولیس با پیروزی ۲ بر ۱ مقابل استقلال به صدر جدول لیگ برتر صعود کرد.",
    "sourceUrl": "https://www.varzesh3.com/news/789012",
    "imageUrl": "https://www.varzesh3.com/static/img/news/789012.jpg",
    "publishedAt": "2024-01-16T19:45:00Z",
    "agencyId": 2,
    "categoryIds": [3],
    "tagIds": [2, 5, 6]
  },
  {
    "title": "پیشرفت‌های جدید در حوزه هوش مصنوعی ایران",
    "content": "محققان ایرانی موفق به توسعه الگوریتم‌های پیشرفته هوش مصنوعی شده‌اند که می‌تواند در تشخیص بیماری‌ها و پیش‌بینی آب و هوا کاربرد داشته باشد. این پروژه که با همکاری دانشگاه‌های تهران و شریف انجام شده، مورد توجه محافل علمی بین‌المللی قرار گرفته است. دکتر احمدی، سرپرست تیم تحقیقاتی، اظهار داشت که این فناوری می‌تواند تحول بزرگی در حوزه پزشکی و هواشناسی ایجاد کند.",
    "summary": "محققان ایرانی الگوریتم‌های پیشرفته هوش مصنوعی برای تشخیص بیماری و پیش‌بینی آب و هوا توسعه دادند.",
    "sourceUrl": "https://www.isna.ir/news/456789",
    "imageUrl": "https://www.isna.ir/static/img/news/456789.jpg",
    "publishedAt": "2024-01-17T14:20:00Z",
    "agencyId": 3,
    "categoryIds": [7],
    "tagIds": [7, 4, 12]
  }
] 